FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/pio/pio_samd20g18.h
#define PINMUX_PA08A_EIC_NMI         ( ( PIN_PA08A_EIC_NMI << 16 ) | MUX_PA08A_EIC_NMI )
#define PORT_PA08A_EIC_NMI           ( 1u << 8 )
/* ========== PORT definition for SERCOM0 peripheral ========== */
#define PIN_PA04D_SERCOM0_PAD0       4        /**< \brief SERCOM0 signal: PAD0 on PA04 mux D */
#define MUX_PA04D_SERCOM0_PAD0       3
#define PINMUX_PA04D_SERCOM0_PAD0    ( ( PIN_PA04D_SERCOM0_PAD0 << 16 ) | MUX_PA04D_SERCOM0_PAD0 )
#define PORT_PA04D_SERCOM0_PAD0      ( 1u << 4 )
#define PIN_PA08C_SERCOM0_PAD0       8        /**< \brief SERCOM0 signal: PAD0 on PA08 mux C */
#define MUX_PA08C_SERCOM0_PAD0       2
#define PINMUX_PA08C_SERCOM0_PAD0    ( ( PIN_PA08C_SERCOM0_PAD0 << 16 ) | MUX_PA08C_SERCOM0_PAD0 )
#define PORT_PA08C_SERCOM0_PAD0      ( 1u << 8 )
#define PIN_PA05D_SERCOM0_PAD1       5        /**< \brief SERCOM0 signal: PAD1 on PA05 mux D */
#define MUX_PA05D_SERCOM0_PAD1       3
#define PINMUX_PA05D_SERCOM0_PAD1    ( ( PIN_PA05D_SERCOM0_PAD1 << 16 ) | MUX_PA05D_SERCOM0_PAD1 )
#define PORT_PA05D_SERCOM0_PAD1      ( 1u << 5 )
#define PIN_PA09C_SERCOM0_PAD1       9        /**< \brief SERCOM0 signal: PAD1 on PA09 mux C */
#define MUX_PA09C_SERCOM0_PAD1       2
#define PINMUX_PA09C_SERCOM0_PAD1    ( ( PIN_PA09C_SERCOM0_PAD1 << 16 ) | MUX_PA09C_SERCOM0_PAD1 )
#define PORT_PA09C_SERCOM0_PAD1      ( 1u << 9 )
#define PIN_PA06D_SERCOM0_PAD2       6        /**< \brief SERCOM0 signal: PAD2 on PA06 mux D */
#define MUX_PA06D_SERCOM0_PAD2       3
#define PINMUX_PA06D_SERCOM0_PAD2    ( ( PIN_PA06D_SERCOM0_PAD2 << 16 ) | MUX_PA06D_SERCOM0_PAD2 )
#define PORT_PA06D_SERCOM0_PAD2      ( 1u << 6 )
#define PIN_PA10C_SERCOM0_PAD2       10       /**< \brief SERCOM0 signal: PAD2 on PA10 mux C */
#define MUX_PA10C_SERCOM0_PAD2       2
#define PINMUX_PA10C_SERCOM0_PAD2    ( ( PIN_PA10C_SERCOM0_PAD2 << 16 ) | MUX_PA10C_SERCOM0_PAD2 )
#define PORT_PA10C_SERCOM0_PAD2      ( 1u << 10 )
#define PIN_PA07D_SERCOM0_PAD3       7        /**< \brief SERCOM0 signal: PAD3 on PA07 mux D */
#define MUX_PA07D_SERCOM0_PAD3       3
#define PINMUX_PA07D_SERCOM0_PAD3    ( ( PIN_PA07D_SERCOM0_PAD3 << 16 ) | MUX_PA07D_SERCOM0_PAD3 )
#define PORT_PA07D_SERCOM0_PAD3      ( 1u << 7 )
#define PIN_PA11C_SERCOM0_PAD3       11       /**< \brief SERCOM0 signal: PAD3 on PA11 mux C */
#define MUX_PA11C_SERCOM0_PAD3       2
#define PINMUX_PA11C_SERCOM0_PAD3    ( ( PIN_PA11C_SERCOM0_PAD3 << 16 ) | MUX_PA11C_SERCOM0_PAD3 )
#define PORT_PA11C_SERCOM0_PAD3      ( 1u << 11 )
/* ========== PORT definition for SERCOM1 peripheral ========== */
#define PIN_PA16C_SERCOM1_PAD0       16       /**< \brief SERCOM1 signal: PAD0 on PA16 mux C */
#define MUX_PA16C_SERCOM1_PAD0       2
#define PINMUX_PA16C_SERCOM1_PAD0    ( ( PIN_PA16C_SERCOM1_PAD0 << 16 ) | MUX_PA16C_SERCOM1_PAD0 )
#define PORT_PA16C_SERCOM1_PAD0      ( 1u << 16 )
#define PIN_PA00D_SERCOM1_PAD0       0        /**< \brief SERCOM1 signal: PAD0 on PA00 mux D */
#define MUX_PA00D_SERCOM1_PAD0       3
#define PINMUX_PA00D_SERCOM1_PAD0    ( ( PIN_PA00D_SERCOM1_PAD0 << 16 ) | MUX_PA00D_SERCOM1_PAD0 )
#define PORT_PA00D_SERCOM1_PAD0      ( 1u << 0 )
#define PIN_PA17C_SERCOM1_PAD1       17       /**< \brief SERCOM1 signal: PAD1 on PA17 mux C */
#define MUX_PA17C_SERCOM1_PAD1       2
#define PINMUX_PA17C_SERCOM1_PAD1    ( ( PIN_PA17C_SERCOM1_PAD1 << 16 ) | MUX_PA17C_SERCOM1_PAD1 )
#define PORT_PA17C_SERCOM1_PAD1      ( 1u << 17 )
#define PIN_PA01D_SERCOM1_PAD1       1        /**< \brief SERCOM1 signal: PAD1 on PA01 mux D */
#define MUX_PA01D_SERCOM1_PAD1       3
#define PINMUX_PA01D_SERCOM1_PAD1    ( ( PIN_PA01D_SERCOM1_PAD1 << 16 ) | MUX_PA01D_SERCOM1_PAD1 )
#define PORT_PA01D_SERCOM1_PAD1      ( 1u << 1 )
#define PIN_PA30D_SERCOM1_PAD2       30       /**< \brief SERCOM1 signal: PAD2 on PA30 mux D */
#define MUX_PA30D_SERCOM1_PAD2       3
#define PINMUX_PA30D_SERCOM1_PAD2    ( ( PIN_PA30D_SERCOM1_PAD2 << 16 ) | MUX_PA30D_SERCOM1_PAD2 )
#define PORT_PA30D_SERCOM1_PAD2      ( 1u << 30 )
#define PIN_PA18C_SERCOM1_PAD2       18       /**< \brief SERCOM1 signal: PAD2 on PA18 mux C */
#define MUX_PA18C_SERCOM1_PAD2       2
#define PINMUX_PA18C_SERCOM1_PAD2    ( ( PIN_PA18C_SERCOM1_PAD2 << 16 ) | MUX_PA18C_SERCOM1_PAD2 )
#define PORT_PA18C_SERCOM1_PAD2      ( 1u << 18 )
#define PIN_PA31D_SERCOM1_PAD3       31       /**< \brief SERCOM1 signal: PAD3 on PA31 mux D */
#define MUX_PA31D_SERCOM1_PAD3       3
#define PINMUX_PA31D_SERCOM1_PAD3    ( ( PIN_PA31D_SERCOM1_PAD3 << 16 ) | MUX_PA31D_SERCOM1_PAD3 )
#define PORT_PA31D_SERCOM1_PAD3      ( 1u << 31 )
#define PIN_PA19C_SERCOM1_PAD3       19       /**< \brief SERCOM1 signal: PAD3 on PA19 mux C */
#define MUX_PA19C_SERCOM1_PAD3       2
#define PINMUX_PA19C_SERCOM1_PAD3    ( ( PIN_PA19C_SERCOM1_PAD3 << 16 ) | MUX_PA19C_SERCOM1_PAD3 )
#define PORT_PA19C_SERCOM1_PAD3      ( 1u << 19 )
/* ========== PORT definition for SERCOM2 peripheral ========== */
#define PIN_PA08D_SERCOM2_PAD0       8        /**< \brief SERCOM2 signal: PAD0 on PA08 mux D */
#define MUX_PA08D_SERCOM2_PAD0       3
#define PINMUX_PA08D_SERCOM2_PAD0    ( ( PIN_PA08D_SERCOM2_PAD0 << 16 ) | MUX_PA08D_SERCOM2_PAD0 )
#define PORT_PA08D_SERCOM2_PAD0      ( 1u << 8 )
#define PIN_PA12C_SERCOM2_PAD0       12       /**< \brief SERCOM2 signal: PAD0 on PA12 mux C */
#define MUX_PA12C_SERCOM2_PAD0       2
#define PINMUX_PA12C_SERCOM2_PAD0    ( ( PIN_PA12C_SERCOM2_PAD0 << 16 ) | MUX_PA12C_SERCOM2_PAD0 )
#define PORT_PA12C_SERCOM2_PAD0      ( 1u << 12 )
#define PIN_PA09D_SERCOM2_PAD1       9        /**< \brief SERCOM2 signal: PAD1 on PA09 mux D */
#define MUX_PA09D_SERCOM2_PAD1       3
#define PINMUX_PA09D_SERCOM2_PAD1    ( ( PIN_PA09D_SERCOM2_PAD1 << 16 ) | MUX_PA09D_SERCOM2_PAD1 )
#define PORT_PA09D_SERCOM2_PAD1      ( 1u << 9 )
#define PIN_PA13C_SERCOM2_PAD1       13       /**< \brief SERCOM2 signal: PAD1 on PA13 mux C */
#define MUX_PA13C_SERCOM2_PAD1       2
#define PINMUX_PA13C_SERCOM2_PAD1    ( ( PIN_PA13C_SERCOM2_PAD1 << 16 ) | MUX_PA13C_SERCOM2_PAD1 )
#define PORT_PA13C_SERCOM2_PAD1      ( 1u << 13 )
#define PIN_PA10D_SERCOM2_PAD2       10       /**< \brief SERCOM2 signal: PAD2 on PA10 mux D */
#define MUX_PA10D_SERCOM2_PAD2       3
#define PINMUX_PA10D_SERCOM2_PAD2    ( ( PIN_PA10D_SERCOM2_PAD2 << 16 ) | MUX_PA10D_SERCOM2_PAD2 )
#define PORT_PA10D_SERCOM2_PAD2      ( 1u << 10 )
#define PIN_PA14C_SERCOM2_PAD2       14       /**< \brief SERCOM2 signal: PAD2 on PA14 mux C */
#define MUX_PA14C_SERCOM2_PAD2       2
#define PINMUX_PA14C_SERCOM2_PAD2    ( ( PIN_PA14C_SERCOM2_PAD2 << 16 ) | MUX_PA14C_SERCOM2_PAD2 )
#define PORT_PA14C_SERCOM2_PAD2      ( 1u << 14 )
#define PIN_PA11D_SERCOM2_PAD3       11       /**< \brief SERCOM2 signal: PAD3 on PA11 mux D */
#define MUX_PA11D_SERCOM2_PAD3       3
#define PINMUX_PA11D_SERCOM2_PAD3    ( ( PIN_PA11D_SERCOM2_PAD3 << 16 ) | MUX_PA11D_SERCOM2_PAD3 )
#define PORT_PA11D_SERCOM2_PAD3      ( 1u << 11 )
#define PIN_PA15C_SERCOM2_PAD3       15       /**< \brief SERCOM2 signal: PAD3 on PA15 mux C */
#define MUX_PA15C_SERCOM2_PAD3       2
#define PINMUX_PA15C_SERCOM2_PAD3    ( ( PIN_PA15C_SERCOM2_PAD3 << 16 ) | MUX_PA15C_SERCOM2_PAD3 )
#define PORT_PA15C_SERCOM2_PAD3      ( 1u << 15 )
/* ========== PORT definition for SERCOM3 peripheral ========== */
#define PIN_PA16D_SERCOM3_PAD0       16       /**< \brief SERCOM3 signal: PAD0 on PA16 mux D */
#define MUX_PA16D_SERCOM3_PAD0       3
#define PINMUX_PA16D_SERCOM3_PAD0    ( ( PIN_PA16D_SERCOM3_PAD0 << 16 ) | MUX_PA16D_SERCOM3_PAD0 )
#define PORT_PA16D_SERCOM3_PAD0      ( 1u << 16 )
#define PIN_PA22C_SERCOM3_PAD0       22       /**< \brief SERCOM3 signal: PAD0 on PA22 mux C */
#define MUX_PA22C_SERCOM3_PAD0       2
#define PINMUX_PA22C_SERCOM3_PAD0    ( ( PIN_PA22C_SERCOM3_PAD0 << 16 ) | MUX_PA22C_SERCOM3_PAD0 )
#define PORT_PA22C_SERCOM3_PAD0      ( 1u << 22 )
#define PIN_PA17D_SERCOM3_PAD1       17       /**< \brief SERCOM3 signal: PAD1 on PA17 mux D */
#define MUX_PA17D_SERCOM3_PAD1       3
#define PINMUX_PA17D_SERCOM3_PAD1    ( ( PIN_PA17D_SERCOM3_PAD1 << 16 ) | MUX_PA17D_SERCOM3_PAD1 )
#define PORT_PA17D_SERCOM3_PAD1      ( 1u << 17 )
#define PIN_PA23C_SERCOM3_PAD1       23       /**< \brief SERCOM3 signal: PAD1 on PA23 mux C */
#define MUX_PA23C_SERCOM3_PAD1       2
#define PINMUX_PA23C_SERCOM3_PAD1    ( ( PIN_PA23C_SERCOM3_PAD1 << 16 ) | MUX_PA23C_SERCOM3_PAD1 )
#define PORT_PA23C_SERCOM3_PAD1      ( 1u << 23 )
#define PIN_PA18D_SERCOM3_PAD2       18       /**< \brief SERCOM3 signal: PAD2 on PA18 mux D */
#define MUX_PA18D_SERCOM3_PAD2       3
#define PINMUX_PA18D_SERCOM3_PAD2    ( ( PIN_PA18D_SERCOM3_PAD2 << 16 ) | MUX_PA18D_SERCOM3_PAD2 )
#define PORT_PA18D_SERCOM3_PAD2      ( 1u << 18 )
#define PIN_PA20D_SERCOM3_PAD2       20       /**< \brief SERCOM3 signal: PAD2 on PA20 mux D */
#define MUX_PA20D_SERCOM3_PAD2       3
#define PINMUX_PA20D_SERCOM3_PAD2    ( ( PIN_PA20D_SERCOM3_PAD2 << 16 ) | MUX_PA20D_SERCOM3_PAD2 )
#define PORT_PA20D_SERCOM3_PAD2      ( 1u << 20 )
#define PIN_PA24C_SERCOM3_PAD2       24       /**< \brief SERCOM3 signal: PAD2 on PA24 mux C */
#define MUX_PA24C_SERCOM3_PAD2       2
#define PINMUX_PA24C_SERCOM3_PAD2    ( ( PIN_PA24C_SERCOM3_PAD2 << 16 ) | MUX_PA24C_SERCOM3_PAD2 )
#define PORT_PA24C_SERCOM3_PAD2      ( 1u << 24 )
#define PIN_PA19D_SERCOM3_PAD3       19       /**< \brief SERCOM3 signal: PAD3 on PA19 mux D */
#define MUX_PA19D_SERCOM3_PAD3       3
#define PINMUX_PA19D_SERCOM3_PAD3    ( ( PIN_PA19D_SERCOM3_PAD3 << 16 ) | MUX_PA19D_SERCOM3_PAD3 )
#define PORT_PA19D_SERCOM3_PAD3      ( 1u << 19 )
#define PIN_PA21D_SERCOM3_PAD3       21       /**< \brief SERCOM3 signal: PAD3 on PA21 mux D */
#define MUX_PA21D_SERCOM3_PAD3       3
#define PINMUX_PA21D_SERCOM3_PAD3    ( ( PIN_PA21D_SERCOM3_PAD3 << 16 ) | MUX_PA21D_SERCOM3_PAD3 )
#define PORT_PA21D_SERCOM3_PAD3      ( 1u << 21 )
#define PIN_PA25C_SERCOM3_PAD3       25       /**< \brief SERCOM3 signal: PAD3 on PA25 mux C */
#define MUX_PA25C_SERCOM3_PAD3       2
#define PINMUX_PA25C_SERCOM3_PAD3    ( ( PIN_PA25C_SERCOM3_PAD3 << 16 ) | MUX_PA25C_SERCOM3_PAD3 )
#define PORT_PA25C_SERCOM3_PAD3      ( 1u << 25 )
/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA12D_SERCOM4_PAD0       12       /**< \brief SERCOM4 signal: PAD0 on PA12 mux D */
#define MUX_PA12D_SERCOM4_PAD0       3
#define PINMUX_PA12D_SERCOM4_PAD0    ( ( PIN_PA12D_SERCOM4_PAD0 << 16 ) | MUX_PA12D_SERCOM4_PAD0 )
#define PORT_PA12D_SERCOM4_PAD0      ( 1u << 12 )
#define PIN_PB08D_SERCOM4_PAD0       40       /**< \brief SERCOM4 signal: PAD0 on PB08 mux D */
#define MUX_PB08D_SERCOM4_PAD0       3
#define PINMUX_PB08D_SERCOM4_PAD0    ( ( PIN_PB08D_SERCOM4_PAD0 << 16 ) | MUX_PB08D_SERCOM4_PAD0 )
#define PORT_PB08D_SERCOM4_PAD0      ( 1u << 8 )
#define PIN_PA13D_SERCOM4_PAD1       13       /**< \brief SERCOM4 signal: PAD1 on PA13 mux D */
#define MUX_PA13D_SERCOM4_PAD1       3
#define PINMUX_PA13D_SERCOM4_PAD1    ( ( PIN_PA13D_SERCOM4_PAD1 << 16 ) | MUX_PA13D_SERCOM4_PAD1 )
#define PORT_PA13D_SERCOM4_PAD1      ( 1u << 13 )
#define PIN_PB09D_SERCOM4_PAD1       41       /**< \brief SERCOM4 signal: PAD1 on PB09 mux D */
#define MUX_PB09D_SERCOM4_PAD1       3
#define PINMUX_PB09D_SERCOM4_PAD1    ( ( PIN_PB09D_SERCOM4_PAD1 << 16 ) | MUX_PB09D_SERCOM4_PAD1 )
#define PORT_PB09D_SERCOM4_PAD1      ( 1u << 9 )
#define PIN_PA14D_SERCOM4_PAD2       14       /**< \brief SERCOM4 signal: PAD2 on PA14 mux D */
#define MUX_PA14D_SERCOM4_PAD2       3
#define PINMUX_PA14D_SERCOM4_PAD2    ( ( PIN_PA14D_SERCOM4_PAD2 << 16 ) | MUX_PA14D_SERCOM4_PAD2 )
#define PORT_PA14D_SERCOM4_PAD2      ( 1u << 14 )
#define PIN_PB10D_SERCOM4_PAD2       42       /**< \brief SERCOM4 signal: PAD2 on PB10 mux D */
#define MUX_PB10D_SERCOM4_PAD2       3
#define PINMUX_PB10D_SERCOM4_PAD2    ( ( PIN_PB10D_SERCOM4_PAD2 << 16 ) | MUX_PB10D_SERCOM4_PAD2 )
#define PORT_PB10D_SERCOM4_PAD2      ( 1u << 10 )
#define PIN_PA15D_SERCOM4_PAD3       15       /**< \brief SERCOM4 signal: PAD3 on PA15 mux D */
#define MUX_PA15D_SERCOM4_PAD3       3
#define PINMUX_PA15D_SERCOM4_PAD3    ( ( PIN_PA15D_SERCOM4_PAD3 << 16 ) | MUX_PA15D_SERCOM4_PAD3 )
#define PORT_PA15D_SERCOM4_PAD3      ( 1u << 15 )
#define PIN_PB11D_SERCOM4_PAD3       43       /**< \brief SERCOM4 signal: PAD3 on PB11 mux D */
#define MUX_PB11D_SERCOM4_PAD3       3
#define PINMUX_PB11D_SERCOM4_PAD3    ( ( PIN_PB11D_SERCOM4_PAD3 << 16 ) | MUX_PB11D_SERCOM4_PAD3 )
#define PORT_PB11D_SERCOM4_PAD3      ( 1u << 11 )
/* ========== PORT definition for SERCOM5 peripheral ========== */
#define PIN_PA22D_SERCOM5_PAD0       22       /**< \brief SERCOM5 signal: PAD0 on PA22 mux D */
#define MUX_PA22D_SERCOM5_PAD0       3
#define PINMUX_PA22D_SERCOM5_PAD0    ( ( PIN_PA22D_SERCOM5_PAD0 << 16 ) | MUX_PA22D_SERCOM5_PAD0 )
#define PORT_PA22D_SERCOM5_PAD0      ( 1u << 22 )
#define PIN_PB02D_SERCOM5_PAD0       34       /**< \brief SERCOM5 signal: PAD0 on PB02 mux D */
#define MUX_PB02D_SERCOM5_PAD0       3
#define PINMUX_PB02D_SERCOM5_PAD0    ( ( PIN_PB02D_SERCOM5_PAD0 << 16 ) | MUX_PB02D_SERCOM5_PAD0 )
#define PORT_PB02D_SERCOM5_PAD0      ( 1u << 2 )
#define PIN_PA23D_SERCOM5_PAD1       23       /**< \brief SERCOM5 signal: PAD1 on PA23 mux D */
#define MUX_PA23D_SERCOM5_PAD1       3
#define PINMUX_PA23D_SERCOM5_PAD1    ( ( PIN_PA23D_SERCOM5_PAD1 << 16 ) | MUX_PA23D_SERCOM5_PAD1 )
#define PORT_PA23D_SERCOM5_PAD1      ( 1u << 23 )
#define PIN_PB03D_SERCOM5_PAD1       35       /**< \brief SERCOM5 signal: PAD1 on PB03 mux D */
#define MUX_PB03D_SERCOM5_PAD1       3
#define PINMUX_PB03D_SERCOM5_PAD1    ( ( PIN_PB03D_SERCOM5_PAD1 << 16 ) | MUX_PB03D_SERCOM5_PAD1 )
#define PORT_PB03D_SERCOM5_PAD1      ( 1u << 3 )
#define PIN_PA24D_SERCOM5_PAD2       24       /**< \brief SERCOM5 signal: PAD2 on PA24 mux D */
#define MUX_PA24D_SERCOM5_PAD2       3
#define PINMUX_PA24D_SERCOM5_PAD2    ( ( PIN_PA24D_SERCOM5_PAD2 << 16 ) | MUX_PA24D_SERCOM5_PAD2 )
#define PORT_PA24D_SERCOM5_PAD2      ( 1u << 24 )
#define PIN_PB22D_SERCOM5_PAD2       54       /**< \brief SERCOM5 signal: PAD2 on PB22 mux D */
#define MUX_PB22D_SERCOM5_PAD2       3
#define PINMUX_PB22D_SERCOM5_PAD2    ( ( PIN_PB22D_SERCOM5_PAD2 << 16 ) | MUX_PB22D_SERCOM5_PAD2 )
#define PORT_PB22D_SERCOM5_PAD2      ( 1u << 22 )
#define PIN_PA20C_SERCOM5_PAD2       20       /**< \brief SERCOM5 signal: PAD2 on PA20 mux C */
#define MUX_PA20C_SERCOM5_PAD2       2
#define PINMUX_PA20C_SERCOM5_PAD2    ( ( PIN_PA20C_SERCOM5_PAD2 << 16 ) | MUX_PA20C_SERCOM5_PAD2 )
#define PORT_PA20C_SERCOM5_PAD2      ( 1u << 20 )
#define PIN_PA25D_SERCOM5_PAD3       25       /**< \brief SERCOM5 signal: PAD3 on PA25 mux D */
#define MUX_PA25D_SERCOM5_PAD3       3
#define PINMUX_PA25D_SERCOM5_PAD3    ( ( PIN_PA25D_SERCOM5_PAD3 << 16 ) | MUX_PA25D_SERCOM5_PAD3 )
#define PORT_PA25D_SERCOM5_PAD3      ( 1u << 25 )
#define PIN_PB23D_SERCOM5_PAD3       55       /**< \brief SERCOM5 signal: PAD3 on PB23 mux D */
#define MUX_PB23D_SERCOM5_PAD3       3
#define PINMUX_PB23D_SERCOM5_PAD3    ( ( PIN_PB23D_SERCOM5_PAD3 << 16 ) | MUX_PB23D_SERCOM5_PAD3 )
#define PORT_PB23D_SERCOM5_PAD3      ( 1u << 23 )
#define PIN_PA21C_SERCOM5_PAD3       21       /**< \brief SERCOM5 signal: PAD3 on PA21 mux C */
#define MUX_PA21C_SERCOM5_PAD3       2
#define PINMUX_PA21C_SERCOM5_PAD3    ( ( PIN_PA21C_SERCOM5_PAD3 << 16 ) | MUX_PA21C_SERCOM5_PAD3 )
#define PORT_PA21C_SERCOM5_PAD3      ( 1u << 21 )
/* ========== PORT definition for TC0 peripheral ========== */
#define PIN_PA04F_TC0_WO0            4        /**< \brief TC0 signal: WO0 on PA04 mux F */
#define MUX_PA04F_TC0_WO0            5
#define PINMUX_PA04F_TC0_WO0         ( ( PIN_PA04F_TC0_WO0 << 16 ) | MUX_PA04F_TC0_WO0 )
#define PORT_PA04F_TC0_WO0           ( 1u << 4 )
#define PIN_PA08E_TC0_WO0            8        /**< \brief TC0 signal: WO0 on PA08 mux E */
#define MUX_PA08E_TC0_WO0            4
#define PINMUX_PA08E_TC0_WO0         ( ( PIN_PA08E_TC0_WO0 << 16 ) | MUX_PA08E_TC0_WO0 )
#define PORT_PA08E_TC0_WO0           ( 1u << 8 )
#define PIN_PA05F_TC0_WO1            5        /**< \brief TC0 signal: WO1 on PA05 mux F */
#define MUX_PA05F_TC0_WO1            5
#define PINMUX_PA05F_TC0_WO1         ( ( PIN_PA05F_TC0_WO1 << 16 ) | MUX_PA05F_TC0_WO1 )
#define PORT_PA05F_TC0_WO1           ( 1u << 5 )
#define PIN_PA09E_TC0_WO1            9        /**< \brief TC0 signal: WO1 on PA09 mux E */
#define MUX_PA09E_TC0_WO1            4
#define PINMUX_PA09E_TC0_WO1         ( ( PIN_PA09E_TC0_WO1 << 16 ) | MUX_PA09E_TC0_WO1 )
#define PORT_PA09E_TC0_WO1           ( 1u << 9 )
/* ========== PORT definition for TC1 peripheral ========== */
#define PIN_PA06F_TC1_WO0            6        /**< \brief TC1 signal: WO0 on PA06 mux F */
#define MUX_PA06F_TC1_WO0            5
#define PINMUX_PA06F_TC1_WO0         ( ( PIN_PA06F_TC1_WO0 << 16 ) | MUX_PA06F_TC1_WO0 )
#define PORT_PA06F_TC1_WO0           ( 1u << 6 )
#define PIN_PA30F_TC1_WO0            30       /**< \brief TC1 signal: WO0 on PA30 mux F */
#define MUX_PA30F_TC1_WO0            5
#define PINMUX_PA30F_TC1_WO0         ( ( PIN_PA30F_TC1_WO0 << 16 ) | MUX_PA30F_TC1_WO0 )
#define PORT_PA30F_TC1_WO0           ( 1u << 30 )
#define PIN_PA10E_TC1_WO0            10       /**< \brief TC1 signal: WO0 on PA10 mux E */
#define MUX_PA10E_TC1_WO0            4
#define PINMUX_PA10E_TC1_WO0         ( ( PIN_PA10E_TC1_WO0 << 16 ) | MUX_PA10E_TC1_WO0 )
#define PORT_PA10E_TC1_WO0           ( 1u << 10 )
#define PIN_PA07F_TC1_WO1            7        /**< \brief TC1 signal: WO1 on PA07 mux F */
#define MUX_PA07F_TC1_WO1            5
#define PINMUX_PA07F_TC1_WO1         ( ( PIN_PA07F_TC1_WO1 << 16 ) | MUX_PA07F_TC1_WO1 )
#define PORT_PA07F_TC1_WO1           ( 1u << 7 )
#define PIN_PA31F_TC1_WO1            31       /**< \brief TC1 signal: WO1 on PA31 mux F */
#define MUX_PA31F_TC1_WO1            5
#define PINMUX_PA31F_TC1_WO1         ( ( PIN_PA31F_TC1_WO1 << 16 ) | MUX_PA31F_TC1_WO1 )
#define PORT_PA31F_TC1_WO1           ( 1u << 31 )
#define PIN_PA11E_TC1_WO1            11       /**< \brief TC1 signal: WO1 on PA11 mux E */
#define MUX_PA11E_TC1_WO1            4
#define PINMUX_PA11E_TC1_WO1         ( ( PIN_PA11E_TC1_WO1 << 16 ) | MUX_PA11E_TC1_WO1 )
#define PORT_PA11E_TC1_WO1           ( 1u << 11 )
/* ========== PORT definition for TC2 peripheral ========== */
#define PIN_PA16F_TC2_WO0            16       /**< \brief TC2 signal: WO0 on PA16 mux F */
#define MUX_PA16F_TC2_WO0            5
#define PINMUX_PA16F_TC2_WO0         ( ( PIN_PA16F_TC2_WO0 << 16 ) | MUX_PA16F_TC2_WO0 )
#define PORT_PA16F_TC2_WO0           ( 1u << 16 )
#define PIN_PA12E_TC2_WO0            12       /**< \brief TC2 signal: WO0 on PA12 mux E */
#define MUX_PA12E_TC2_WO0            4
#define PINMUX_PA12E_TC2_WO0         ( ( PIN_PA12E_TC2_WO0 << 16 ) | MUX_PA12E_TC2_WO0 )
#define PORT_PA12E_TC2_WO0           ( 1u << 12 )
#define PIN_PA00F_TC2_WO0            0        /**< \brief TC2 signal: WO0 on PA00 mux F */
#define MUX_PA00F_TC2_WO0            5
#define PINMUX_PA00F_TC2_WO0         ( ( PIN_PA00F_TC2_WO0 << 16 ) | MUX_PA00F_TC2_WO0 )
#define PORT_PA00F_TC2_WO0           ( 1u << 0 )
#define PIN_PA17F_TC2_WO1            17       /**< \brief TC2 signal: WO1 on PA17 mux F */
#define MUX_PA17F_TC2_WO1            5
#define PINMUX_PA17F_TC2_WO1         ( ( PIN_PA17F_TC2_WO1 << 16 ) | MUX_PA17F_TC2_WO1 )
#define PORT_PA17F_TC2_WO1           ( 1u << 17 )
#define PIN_PA13E_TC2_WO1            13       /**< \brief TC2 signal: WO1 on PA13 mux E */
#define MUX_PA13E_TC2_WO1            4
#define PINMUX_PA13E_TC2_WO1         ( ( PIN_PA13E_TC2_WO1 << 16 ) | MUX_PA13E_TC2_WO1 )
#define PORT_PA13E_TC2_WO1           ( 1u << 13 )
#define PIN_PA01F_TC2_WO1            1        /**< \brief TC2 signal: WO1 on PA01 mux F */
#define MUX_PA01F_TC2_WO1            5
#define PINMUX_PA01F_TC2_WO1         ( ( PIN_PA01F_TC2_WO1 << 16 ) | MUX_PA01F_TC2_WO1 )
#define PORT_PA01F_TC2_WO1           ( 1u << 1 )
/* ========== PORT definition for TC3 peripheral ========== */
#define PIN_PA18F_TC3_WO0            18       /**< \brief TC3 signal: WO0 on PA18 mux F */
#define MUX_PA18F_TC3_WO0            5
#define PINMUX_PA18F_TC3_WO0         ( ( PIN_PA18F_TC3_WO0 << 16 ) | MUX_PA18F_TC3_WO0 )
#define PORT_PA18F_TC3_WO0           ( 1u << 18 )
#define PIN_PA14E_TC3_WO0            14       /**< \brief TC3 signal: WO0 on PA14 mux E */
#define MUX_PA14E_TC3_WO0            4
#define PINMUX_PA14E_TC3_WO0         ( ( PIN_PA14E_TC3_WO0 << 16 ) | MUX_PA14E_TC3_WO0 )
#define PORT_PA14E_TC3_WO0           ( 1u << 14 )
#define PIN_PA19F_TC3_WO1            19       /**< \brief TC3 signal: WO1 on PA19 mux F */
#define MUX_PA19F_TC3_WO1            5
#define PINMUX_PA19F_TC3_WO1         ( ( PIN_PA19F_TC3_WO1 << 16 ) | MUX_PA19F_TC3_WO1 )
#define PORT_PA19F_TC3_WO1           ( 1u << 19 )
#define PIN_PA15E_TC3_WO1            15       /**< \brief TC3 signal: WO1 on PA15 mux E */
#define MUX_PA15E_TC3_WO1            4
#define PINMUX_PA15E_TC3_WO1         ( ( PIN_PA15E_TC3_WO1 << 16 ) | MUX_PA15E_TC3_WO1 )
#define PORT_PA15E_TC3_WO1           ( 1u << 15 )
/* ========== PORT definition for TC4 peripheral ========== */
#define PIN_PA22F_TC4_WO0            22       /**< \brief TC4 signal: WO0 on PA22 mux F */
#define MUX_PA22F_TC4_WO0            5
#define PINMUX_PA22F_TC4_WO0         ( ( PIN_PA22F_TC4_WO0 << 16 ) | MUX_PA22F_TC4_WO0 )
#define PORT_PA22F_TC4_WO0           ( 1u << 22 )
#define PIN_PB08F_TC4_WO0            40       /**< \brief TC4 signal: WO0 on PB08 mux F */
#define MUX_PB08F_TC4_WO0            5
#define PINMUX_PB08F_TC4_WO0         ( ( PIN_PB08F_TC4_WO0 << 16 ) | MUX_PB08F_TC4_WO0 )
#define PORT_PB08F_TC4_WO0           ( 1u << 8 )
#define PIN_PA23F_TC4_WO1            23       /**< \brief TC4 signal: WO1 on PA23 mux F */
#define MUX_PA23F_TC4_WO1            5
#define PINMUX_PA23F_TC4_WO1         ( ( PIN_PA23F_TC4_WO1 << 16 ) | MUX_PA23F_TC4_WO1 )
#define PORT_PA23F_TC4_WO1           ( 1u << 23 )
#define PIN_PB09F_TC4_WO1            41       /**< \brief TC4 signal: WO1 on PB09 mux F */
#define MUX_PB09F_TC4_WO1            5
#define PINMUX_PB09F_TC4_WO1         ( ( PIN_PB09F_TC4_WO1 << 16 ) | MUX_PB09F_TC4_WO1 )
#define PORT_PB09F_TC4_WO1           ( 1u << 9 )
/* ========== PORT definition for TC5 peripheral ========== */
#define PIN_PA24F_TC5_WO0            24       /**< \brief TC5 signal: WO0 on PA24 mux F */
#define MUX_PA24F_TC5_WO0            5
#define PINMUX_PA24F_TC5_WO0         ( ( PIN_PA24F_TC5_WO0 << 16 ) | MUX_PA24F_TC5_WO0 )
#define PORT_PA24F_TC5_WO0           ( 1u << 24 )
#define PIN_PB10F_TC5_WO0            42       /**< \brief TC5 signal: WO0 on PB10 mux F */
#define MUX_PB10F_TC5_WO0            5
#define PINMUX_PB10F_TC5_WO0         ( ( PIN_PB10F_TC5_WO0 << 16 ) | MUX_PB10F_TC5_WO0 )
#define PORT_PB10F_TC5_WO0           ( 1u << 10 )
#define PIN_PA25F_TC5_WO1            25       /**< \brief TC5 signal: WO1 on PA25 mux F */
#define MUX_PA25F_TC5_WO1            5
#define PINMUX_PA25F_TC5_WO1         ( ( PIN_PA25F_TC5_WO1 << 16 ) | MUX_PA25F_TC5_WO1 )
#define PORT_PA25F_TC5_WO1           ( 1u << 25 )
#define PIN_PB11F_TC5_WO1            43       /**< \brief TC5 signal: WO1 on PB11 mux F */
#define MUX_PB11F_TC5_WO1            5
#define PINMUX_PB11F_TC5_WO1         ( ( PIN_PB11F_TC5_WO1 << 16 ) | MUX_PB11F_TC5_WO1 )
#define PORT_PB11F_TC5_WO1           ( 1u << 11 )
/* ========== PORT definition for TC6 peripheral ========== */
#define PIN_PB02F_TC6_WO0            34       /**< \brief TC6 signal: WO0 on PB02 mux F */
#define MUX_PB02F_TC6_WO0            5
#define PINMUX_PB02F_TC6_WO0         ( ( PIN_PB02F_TC6_WO0 << 16 ) | MUX_PB02F_TC6_WO0 )
#define PORT_PB02F_TC6_WO0           ( 1u << 2 )
#define PIN_PB03F_TC6_WO1            35       /**< \brief TC6 signal: WO1 on PB03 mux F */
#define MUX_PB03F_TC6_WO1            5
#define PINMUX_PB03F_TC6_WO1         ( ( PIN_PB03F_TC6_WO1 << 16 ) | MUX_PB03F_TC6_WO1 )
#define PORT_PB03F_TC6_WO1           ( 1u << 3 )
/* ========== PORT definition for TC7 peripheral ========== */
#define PIN_PB22F_TC7_WO0            54       /**< \brief TC7 signal: WO0 on PB22 mux F */
#define MUX_PB22F_TC7_WO0            5
